app/controllers/articles_controller.rb

  def show
    @article = Article.last
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "date", "author", "published", "category", "original", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "date" = $1, "author" = $2, "published" = $3, "category" = $4, "original" = $5, "updated_at" = $6 WHERE "articles"."id" = $7  [["date", ""], ["author", "بیژن"], ["published", false], ["category", "سیاسی"], ["original", false], ["updated_at", "2023-09-22 08:04:34.480147"], ["id", 3]]