app/controllers/dashboard_controller.rb

SELECT "sandboxes".* FROM "sandboxes"
---
  def index
    # fetch_articles
    @sandboxes = Sandbox.all

SELECT "sandboxes".* FROM "sandboxes"
INSERT INTO "sandboxes" ("title", "content", "source", "created_at", "updated_at", "edited_title", "edited_content", "photo_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def fetch_articles
    sandboxall = Sandbox.all
    sandboxall.each do |item|
      tarikh = item.created_at
      today = Date.today
      if today.strftime("%Y-%m-%d").to_i - tarikh.strftime("%Y-%m-%d").to_i >= 1
        item.destroy!
      end
    end

    # START RADIOFARDA
    require 'rss'
    require 'open-uri'
    url = 'https://www.radiofarda.com/rss/'
    URI.open(url) do |rss|
      feed = RSS::Parser.parse(rss)
      feed.items.each do |item|
        if item.description != ''
          sandbox = Sandbox.new(title: item.title, content: item.description, source: 'رادیو فردا', photo_url: item.enclosure.url)
          sandbox.save!

INSERT INTO "sandboxes" ("title", "content", "source", "created_at", "updated_at", "edited_title", "edited_content", "photo_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      feed.items.each do |item|
        if item.description != ''
          sandbox = Sandbox.new(title: item.title, content: item.description, source: 'ایلنا', photo_url: item.enclosure.url)
          sandbox.save!

SELECT "sandboxes".* FROM "sandboxes"
DELETE FROM "sandboxes" WHERE "sandboxes"."id" = $1  [["id", 30]]
---
  end

  sandboxall = Sandbox.all
  sandboxall.each do |sandbox|
    if sandbox.content.length > 500 || sandbox.content.length < 100
      sandbox.destroy!