app/controllers/pages_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1  [["category_id", nil]]
---
  def home
    @headern = Article.last
    @kholase = @headern.content.truncate(300, separator: ' ')
    j = @kholase
    j.tr!('0123456789','۰١۲۳۴۵۶۷۸۹')
    @b = j.html_safe
    @akhbar = Article.all.order(id: :desc)
    @pishkhan = @akhbar.offset(1).limit(6)
    # @pishkhan.reject!{|news| news == @headern}
    # @pishkhan = @pishkhan.sort {|a,b| b <=> a}
    @categories = Category.all
    @siasi = @akhbar.where(category_id: 1).limit(5)