app/controllers/sandbox_controller.rb

SELECT "sandboxes".* FROM "sandboxes"
---
  def index
    @all = Sandbox.all

SELECT "sandboxes".* FROM "sandboxes" WHERE "sandboxes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sandbox = Sandbox.find(params[:id])