class SandboxController < ApplicationController


  def index
    @all = Sandbox.all
  end

  def show
    client = OpenAI::Client.new(
      log_errors: true # Highly recommended in development, so you can see what errors OpenAI is returning. Not recommended in production.
    )
    @sandbox = Sandbox.find(params[:id])
    response = client.chat(
      parameters: {
          model: "gpt-3.5-turbo", # Required.
          messages: [{ role: "user", content: "لطفا این مقاله را برایم بازنویسی کن: #{@sandbox.content}"}], # Required.
          temperature: 0.7,
      })
    @sandbox.edited_content = response.dig("choices", 0, "message", "content")



    # @sandbox.edited_content = ChatgptService.call("لطفا این مقاله را برایم بازنویسی کن: #{@sandbox.content}")
    # @sandbox.edited_content.tr("لطفا این مقاله را برایم بازنویسی کنید: ", "")
    # @sandbox.edited_title = ChatgptService.call("لطفا این موضوع خبری را برایم بازنویسی کن: #{@sandbox.title}")
    # # @sandbox.edited_title = "مثال تایتل"
    # # @sandbox.edited_content = "در آخرین مرحله از تفاهم تبادل زندانیان میان ایران و آمریکا، هواپیمای حامل پنج زندانی آزادشده آمریکایی در دوحه به زمینه نشست. این هواپیما از جمله شامل دو عضو خانواده دو تن از این زندانیان است که قرار است آنها را در بازگشت به آمریکا همراهی کنند.
    # # # در این زمینه یک مقام ارشد دولت آمریکا به رادیوفردا گفت که اخبار مربوط به ترک هواپیمای حامل زندانیان آمریکایی به مقصد قطر را تأیید می‌کند.
    # # # همزمان خبرگزاری‌ها گزارش کردند که دو زندانی ایرانی آزادشده در آمریکا که تمایل به بازگشت به ایران داشتند، به دوحه قطر رسیده‌اند. پرس‌تی‌وی، شبکه خبری انگلیسی‌زبان وابسته به رادیو و تلویزیون حکومتی ایران (صداوسیما)، این دو تن را مهرداد معین انصاری و رضا سرهنگ‌پور معرفی کرده است.
    # # # در این میان، جو بایدن، رئیس جمهور آمریکا، در بیانیه‌ای با ابراز خرسندی از آزادی پنج شهروند آمریکایی که در ایران زندانی بودند، از دولت‌های قطر، عمان، سوئیس و کره جنوبی به عنوان شرکای واشینگتن و تلاش آن‌ها برای محقق شدن این امر قدردانی کرد.
    # # # آقای بایدن همچنین از شیخ تمیم بن حمد آل ثانی، امیر قطر و هیثم بن طارق، پادشاه عمان، به‌شکل ویژه قدردانی کرده است که به گفتۀ او، دستیابی به توافق با تهران را در طول ماه‌های دشوار و هم‌سو با دیپلماسی اصولی آمریکا تسهیل کردند.
    # # # او تصریح کرده است که سیامک نمازی، مراد طاهباز، عماد شرقی و دو شهروند دیگر آمریکا که به‌دلایل شخصی مایل به افشای نام خود نبودند، پس از «تحمل سال‌ها درد و رنج و تعلیق» به‌زودی به عزیزان خود ملحق خواهند شد.
    # # # رئیس جمهور ایالات متحده همچنین تأکید کرد که هم‌زمان با خوشامدگویی به آمریکایی‌های آزاد شده، بار دیگر به تمام شهروندان آمریکا «خطرات جدی» سفر به ایران را یادآوری می‌کند: «دارندگان گذرنامۀ آمریکایی نباید به آن‌جا [ایران] سفر کنند.»
    # # # جو بایدن از شهروندان آمریکا خواست هشدار وزارت خارجۀ این کشور در مورد سفر به ایران را جدی بگیرند و در صورت بی‌توجهی به این هشدار، انتظار تضمین آزادی خود را نداشته باشند.
    # # # آقای بایدن سپس با اشاره به تحریم اعمال‌شده علیه محمود احمدی‌نژاد و وزارت اطلاعات جمهوری اسلامی، «رژیم ایران» را فراخوانده است تا «روایت کاملی از آن‌چه بر باب لوینسن رفته‌است» ارائه دهد و تأکید کرده که خانوادۀ او سزاوار دریافت پاسخ پرسش‌های خود هستند.
    # # # "
    # @sandbox.edited_title.tr("لطفا این موضوع خبری را برایم بازنویسی کن: ", "")
    if @sandbox.source == "رادیو فردا"
      @sandbox.photo_url = @sandbox.photo_url.delete "https://gdb.rferl.org/"
    end
    @article = Article.new
  end

end
